# Using CSV,EXCEL File

In [ ]:
import pandas as pd
df=pd.read_csv("weather.csv")
df=pd.read_excel("weather.xlsx")

# Using List

In [1]:
data={
    "Name":["Alka","Pinki","Khitij"],
    "Age":["10","20","30"],
    "DOB":["12/02/2012","23/02/1999","22/12/2012"]
}

In [3]:
import pandas as pd
data1=pd.DataFrame(data)

In [4]:
data1

     Name Age         DOB
0    Alka  10  12/02/2012
1   Pinki  20  23/02/1999
2  Khitij  30  22/12/2012

# Using Tuple

In [50]:
data={ 
    "Name":("Alka","Pinki","Khitij"),
    "Age":("10","20","30"),
}

In [51]:
pd.DataFrame(data)

     Name Age
0    Alka  10
1   Pinki  20
2  Khitij  30

In [52]:
data=[ 
    
    ("Alka","30","12/02/2012"),
    ("PInki","20","23/02/1999"),

    ("Kshitij","34","22/12/2012")
]

In [53]:
pd.DataFrame(data,columns=["Name","Age","DOB"])

      Name Age         DOB
0     Alka  30  12/02/2012
1    PInki  20  23/02/1999
2  Kshitij  34  22/12/2012

In [54]:
data1=[ 
    {"Name":"ALKA","Age":21},
    {"Name":"pinki","Age":22}
]

In [42]:
pd.DataFrame(data1)

    Name  Age
0   ALKA   21
1  pinki   22

In [65]:
data1=pd.DataFrame({   
    "Name":["ALKA","Pinki"],
    "Age":[23,44]
})

data2=pd.DataFrame({
    "Name":["ALKA","Pinki"],
    "Age":[23,44]
})

In [66]:
with pd.ExcelWriter('DataFrames.xlsx') as writer:
    data1.to_excel(writer,sheet_name="Data")
    data2.to_excel(writer,sheet_name="Frame")